---
kind: method
id: M:Autodesk.Revit.DB.LeaderArray.ForwardIterator
source: html/63ab6444-2246-3093-e1bb-4d54638141b4.htm
---
# Autodesk.Revit.DB.LeaderArray.ForwardIterator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual LeaderArrayIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the array.